- Display the first 5 rows of the table.
- Display the last 3 rows of the table.
- Show information about the data types of each column.
- Find the average age of employees.
- Determine the maximum salary among all employees.
- Find the minimum start date.
- Display the names of employees in the IT department.
- Sort the table by salary in descending order.
- Display all employees with a salary above 70000.
- Count the number of employees in each department.
- Find the average salary of employees in the HR department.
- Determine the number of employees older than 30 years.
- Find the name of the employee with the earliest start date.
- Add a new column with the number of years of work based on the StartDate column.
- Display employees who started working in 2017.
- Find the employee with the highest salary.
- Determine the average length of work (in years) of employees.
- Display a list of departments where employees work, without repetition.
- Determine the average age of employees in each department.

In [373]:
import pandas as pd
from datetime import datetime
de = pd.read_csv("employee_exc_3.csv")
de

   EmployeeID        Name  Age Department  Salary   StartDate
0           1  John Smith   28         HR   50000  2019-01-15
1           2    Jane Doe   34         IT   75000  2018-05-23
2           3   Sam Brown   45         IT   80000  2015-08-01
3           4    Lisa Ray   29         HR   52000  2020-10-12
4           5  Mark Green   40      Sales   65000  2017-03-11
5           6  Anna White   32         IT   72000  2016-04-20
6           7   Tom Black   38      Sales   68000  2017-09-30

In [374]:
de.head(5)

   EmployeeID        Name  Age Department  Salary   StartDate
0           1  John Smith   28         HR   50000  2019-01-15
1           2    Jane Doe   34         IT   75000  2018-05-23
2           3   Sam Brown   45         IT   80000  2015-08-01
3           4    Lisa Ray   29         HR   52000  2020-10-12
4           5  Mark Green   40      Sales   65000  2017-03-11

In [375]:
de.tail(3)

   EmployeeID        Name  Age Department  Salary   StartDate
4           5  Mark Green   40      Sales   65000  2017-03-11
5           6  Anna White   32         IT   72000  2016-04-20
6           7   Tom Black   38      Sales   68000  2017-09-30

In [376]:
de.dtypes

EmployeeID     int64
Name          object
Age            int64
Department    object
Salary         int64
StartDate     object
dtype: object

In [377]:
de["Age"].mean()

35.142857142857146

In [378]:
de["Salary"].max()

80000

In [379]:
de["StartDate"].min()

'2015-08-01'

In [380]:
de[de["Department"] == "IT"]["Name"]

1      Jane Doe
2     Sam Brown
5    Anna White
Name: Name, dtype: object

In [381]:
de.sort_values(by="Salary")

   EmployeeID        Name  Age Department  Salary   StartDate
0           1  John Smith   28         HR   50000  2019-01-15
3           4    Lisa Ray   29         HR   52000  2020-10-12
4           5  Mark Green   40      Sales   65000  2017-03-11
6           7   Tom Black   38      Sales   68000  2017-09-30
5           6  Anna White   32         IT   72000  2016-04-20
1           2    Jane Doe   34         IT   75000  2018-05-23
2           3   Sam Brown   45         IT   80000  2015-08-01

In [382]:
de[de["Salary"] > 70000]

   EmployeeID        Name  Age Department  Salary   StartDate
1           2    Jane Doe   34         IT   75000  2018-05-23
2           3   Sam Brown   45         IT   80000  2015-08-01
5           6  Anna White   32         IT   72000  2016-04-20

In [383]:
de.groupby(["Department"]).size()

Department
HR       2
IT       3
Sales    2
dtype: int64

In [384]:
de[de["Department"] == "HR"]["Salary"].mean()

51000.0

In [385]:
len(de[de["Age"] > 30])

5

In [386]:
de[de["StartDate"] == min(de["StartDate"])]["Name"]

2    Sam Brown
Name: Name, dtype: object

In [387]:
de["StartDate"] = pd.to_datetime(de["StartDate"]) # преобразовываем текущую дату в datetime что бы иметь возможность отнимать от формата текущей даты
today = datetime.today()
de["YearsOfWork"] = (today - de["StartDate"]).dt.days // 365 # выявляем только года и округляем до 2 знаков после запятой
de

   EmployeeID        Name  Age Department  Salary  StartDate  YearsOfWork
0           1  John Smith   28         HR   50000 2019-01-15            5
1           2    Jane Doe   34         IT   75000 2018-05-23            6
2           3   Sam Brown   45         IT   80000 2015-08-01            8
3           4    Lisa Ray   29         HR   52000 2020-10-12            3
4           5  Mark Green   40      Sales   65000 2017-03-11            7
5           6  Anna White   32         IT   72000 2016-04-20            8
6           7   Tom Black   38      Sales   68000 2017-09-30            6

In [388]:
de[de["StartDate"].dt.year == 2017] # выбираем только год

   EmployeeID        Name  Age Department  Salary  StartDate  YearsOfWork
4           5  Mark Green   40      Sales   65000 2017-03-11            7
6           7   Tom Black   38      Sales   68000 2017-09-30            6

In [389]:
de[de["Salary"] == max(de["Salary"])]["Name"]

2    Sam Brown
Name: Name, dtype: object

In [390]:
de["Department"].unique()

array(['HR', 'IT', 'Sales'], dtype=object)

In [391]:
de.groupby("Department")["Age"].mean()

Department
HR       28.5
IT       37.0
Sales    39.0
Name: Age, dtype: float64

In [392]:
min(de.groupby("StartDate")["Name"])

(Timestamp('2015-08-01 00:00:00'),
 2    Sam Brown
 Name: Name, dtype: object)